Tekla.Structures.CatalogInternal.ICDelegate.ExportSelectParametricProfileItemByPrefix(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportSelectParametricProfileItemByTypeAndSubType(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportSelectParametricProfileItemByProfileName(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportSelectProfileItemByTypeAndSubType(System.Int32,System.Int32,System.Int32,Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
ProfileItemType: The profile item type.
ProfileItemSubType: The profile item sub type.
CrossSectionNumber: The cross section number.
rProfileItem: The profile item instance.
Returns: True if success, otherwise false.

Tekla.Structures.CatalogInternal.ICDelegate.AddCrossSection(System.String,System.Int32,System.Double,System.Int32,System.Int32)
DO NOT USE! For internal usage only!
ProfileName: The profile name.
CrossSectionNumber: The cross section number.
Location: The location value.
Type: The type number.
SubType: The subtype number.
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ModifyCrossSection(System.String,System.Int32,System.Double,System.Int32,System.Int32)
DO NOT USE! For internal usage only!
ProfileName: The profile name.
CrossSectionNumber: The cross section number.
Location: The location value.
Type: The type number.
SubType: The subtype number.
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.DeleteCrossSection(System.String,System.Int32)
DO NOT USE! For internal usage only!
ProfileName: The profile name.
CrossSectionNumber: The cross section number.
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.SetEquivalentType(System.String,System.Int32,System.Int32)
DO NOT USE! For internal usage only!
ProfileName: The profile name.
CrossSectionNumber: The cross section number.
EquivalentType: The equivalent type.
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.GetProfileItemCrossSection(System.String,System.Int32,Tekla.Structures.CatalogInternal.dotcatProfileItemCrossSection_t@)
DO NOT USE! For internal usage only!
ProfileName: The profile name.
isParametric: Specify is the profile is parametric or not.
CrossSection: The cross section.
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ModifyProfileItemProperties(Tekla.Structures.CatalogInternal.dotcatProfileItemPropertiesEnumerator_s@)
DO NOT USE! For internal usage only!
ProfileItemProperties: The profile item properties.
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.GetProfileItemPropertiesByTypeAndSubType(System.Int32,System.Int32,Tekla.Structures.CatalogInternal.dotcatProfileItemCrossSection_t@)
DO NOT USE! For internal usage only!
Type: The profile type.
SubType: The profile sub type.
CrossSection: The cross section.
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportSelectProfileItemSubTypes(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@,Tekla.Structures.CatalogInternal.dotcatProfileItemSubTypeEnumerator_t@)
DO NOT USE! For internal usage only!
pProfileItem:
pProfileItemSubTypeEnumerator:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportProfileItemsToFile(Tekla.Structures.CatalogInternal.dotcatProfileNames_t@,System.String,System.String)
DO NOT USE! For internal usage only!
profileNames: The profile names.
path: The file path.
fileName: The file name.
Returns: 1 on success.

Tekla.Structures.CatalogInternal.ICDelegate.ExportAddProfileItem(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@,Tekla.Structures.CatalogInternal.dotcatProfileName_t@)
DO NOT USE! For internal usage only!
pProfileItem:
pNewName:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportGetParametricProfileTypeByPrefix(System.String,System.Int32@)
DO NOT USE! For internal usage only!
pProfilePrefix:
rProfileType:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportGetProfileType(System.String,System.Int32@)
DO NOT USE! For internal usage only!
pProfileName:
rProfileType:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportDeleteUserParametricProfileItem(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportProfileItemProperties(Tekla.Structures.CatalogInternal.dotcatProfileItemPropertiesEnumerator_s@)
DO NOT USE! For internal usage only!
pProfileItemProperties:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportRenameProfileItem(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@,Tekla.Structures.CatalogInternal.dotcatProfileName_t@)
DO NOT USE! For internal usage only!
pProfileItem:
pNewName:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportSaveProfileDatabaseNew
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportCreateSavePoint
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportRollbackToSavePoint
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportFinalizeImportProfilesFromFolderWithoutSave(System.Collections.Generic.List{System.Object}@)
DO NOT USE! For internal usage only!
pConflicts:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportImportCustomComponentsFromPathWithUpdateCheck(System.String,System.Boolean)
DO NOT USE! For internal usage only!
Path:
ForcedUpdate:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportGetTranslatedOptionLabels(Tekla.Structures.CatalogInternal.dotcatUserPropertyOption2_t@)
DO NOT USE! For internal usage only!
userPropertyOption2:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportConvertFabricatorProfilesAndMaterialsToTS(Tekla.Structures.CatalogInternal.dotcatFabricatorDataFilePaths_t@)
DO NOT USE! For internal usage only!
FabricatorDataFilePaths:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportFinishList
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.GetShapeByGuid(Tekla.Structures.CatalogInternal.dotcatShape_t@,System.String)
DO NOT USE! For internal usage only! Insert a shape.
shape: Shape to be initialized based on the input guid
shapeGuid: Shape guid
Returns: true (1) on success, false(0) otherwise